ParkerSD/FlashBlaster/nRF5_SDK_16.0.0_98a08e2/examples/ble_peripheral/ble_app_uart/pca10056/s140/ses/system.c
    if(project_count != 0)
    {   
        // buffer all project pointers 
        uint32_t total_projects_length = project_count * WORD_SIZE; 
        uint8_t project_addr[total_projects_length]; // array sized for all project addresses 
        flash_read(project_addr, ADDR_PROJECT_PTR_FIRST, total_projects_length); // buffer for all project addresses
        
        // create first project in RAM, extract to function
        char* project_buffer = malloc(sizeof(char[PROJECT_HEADER_SIZE])); // name string plus num_chips malloc 
        uint32_t current_addr = project_addr[0] << 24 | project_addr[1] << 16 | project_addr[2] << 8 | project_addr[3]; // shift bytes into 32bit int
        flash_read(project_buffer, current_addr, PROJECT_HEADER_SIZE);
        SYS_ project_first = project_new(project_buffer); // create first project(head of list) 

        // create remainder of projects, first project already made 
        for(int i = 0; i < project_count; i++) 
        {   
            // convert 4 bytes into 32bit number 
            current_addr = project_addr[0 + (i*4)]  << 24 | project_addr[1 + (i*4)] << 16 | project_addr[2 + (i*4)] << 8 | project_addr[3 + (i*4)];
            flash_read(project_buffer, current_addr, PROJECT_HEADER_SIZE);// read project data 
            project_new(project_buffer);
        }
        free(project_buffer);
    }
    else
    {
        SYS_ project_first = project_create(); // create empty project - chip - file structures
        SYS_ project_first->chip_first = chip_create();
        SYS_ project_first->chip_first->file_first = file_create();
    }
}


project_struct* project_list_index(int index) 
{ 
    project_struct* projectN;
    projectN = SYS_ project_first; 

    for(int i = 1; i < index; i++) // minus 1 loop since file_first was already factored in
    {
        projectN = projectN->project_next; 
    }
    return projectN; 
}


project_struct* project_new(char* data) //input 24 byte project data, string, num_chips, and chip_first address
{
    project_struct* projectY = project_create(); //create project
    projectY->project_name = name_fetch(data);  // send in payload, fetch from flash
    projectY->chip_num = *(data+16) << 24 | *(data+17) << 16 | *(data+18) << 8 | *(data+19);//TODO: chip_num_fetch(data) - last 4 bytes of 20 bytes;
    projectY->project_next = NULL;
    projectY->chip_first = NULL; 
    projectY->chip_list_addr = DIRECTORY_OFFSET + PROJECT_HEADER_SIZE + (SYS_ project_curr * MAX_PROJECT_SIZE); //was *(data+20) << 24 | *(data+21) << 16 | *(data+22) << 8 | *(data+23);// NOTE MAKE ACTUAL FLASH ADDRESS OF FIRST CHIP BASED ON MAX PROJECT LENGTH 
    projectY->chip_curr = 0;

    if(SYS_ project_curr != 0) //push node, add to project_next
    {  
        int olderSiblingIndex = (SYS_ project_curr - 1);  
        project_struct* projectZ = project_list_index(olderSiblingIndex);    //index olderSibling and assign project to project_next node of last created project, older sibling is at index of SYS_ project_num
        projectZ->project_next = projectY;  
    }
  
    projectY->project_index = SYS_ project_curr; // NOTE: POSSIBLE BUG HERE, should index from zero
    SYS_ project_curr += 1; 

    return projectY; //should return newly created to global
}


project_struct* project_create(void) //TODO: render only existing chips
{
    project_struct* projectX = malloc(sizeof(project_struct));
    
    projectX->project_name = "Empty"; //project_name_fetch();
    projectX->project_index = NULL;
    projectX->project_next = NULL;
    projectX->chip_num = 0;
    projectX->chip_curr = 0;
    projectX->chip_first = NULL; // chip_create();
    projectX->chip_list_addr = NULL;
    
    projectIterator++;
    return projectX; 
}

//**************************************************************************************************************************************************//

void flash_init(void)
{   
    // ADDR_NUM_PROJECTS 0
    // ADDR_PROJECT_PTR_FIRST 4

    // init flash for test below 
    flash_erase(0, NRF_QSPI_ERASE_LEN_4KB); // erase all 

    //DIRECTORY                                                           //288
    uint8_t directory[32] = {0, 0, 0, 3, 0, 0, 0, 32, 0, 0, 0, 160, 0, 0, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}; // num projects: 1, first project address: 32
    flash_write(directory, 0, 32); // write test directory

    //NOTE PROJECT 1 - 24 bytes (including first chip addr) 
    uint8_t project_string_test0[] = {"project0"}; //long form, single write {'p', 'r', 'o', 'j', 'e', 'c', 't', '0', 0, 0, 0, 1, 0, 0, 2, 0}; 
    uint8_t chip_num_test[WORD_SIZE] = {0, 0, 0, 3};
    uint8_t chip_ptr_first_test[WORD_SIZE] = {0, 0, 2, 0}; //address 512 when bit shifted
    uint8_t chip_ptr_sec_test[WORD_SIZE] = {0, 0, 2, 128}; //address 640 when bit shifted
    uint8_t chip_ptr_three_test[WORD_SIZE] = {0, 0, 3, 0}; //address 768 when bit shifted
    flash_write(project_string_test0, 32, MAX_STRING_SIZE); // name sting 16 bytes long 
    flash_write(chip_num_test, 48, WORD_SIZE); // chip num 4 bytes, address 48 (after string) 
    flash_write(chip_ptr_first_test, 52, WORD_SIZE); // write first chip ptr after chip_num value of first project
    flash_write(chip_ptr_sec_test, 56, WORD_SIZE);
    flash_write(chip_ptr_three_test, 60, WORD_SIZE);
    //CHIP 0 - 28 bytes (including first file addr) 
    uint8_t chip_string_test0[] = {"chip0"}; //16 bytes
    uint8_t chip_type_ID[WORD_SIZE] = {0, 0, 7, 0}; 
    uint8_t files_num[WORD_SIZE] = {0, 0, 0, 3}; 
    uint8_t files_first_addr[WORD_SIZE] = {0, 0, 3, 128}; // 896
    uint8_t files_sec_addr[WORD_SIZE] = {0, 0, 3, 156}; // 924
    uint8_t files_third_addr[WORD_SIZE] = {0, 0, 3, 184}; // 952 
    flash_write(chip_string_test0, 512, MAX_STRING_SIZE);
    flash_write(chip_type_ID, 528, WORD_SIZE);
    flash_write(files_num, 532, WORD_SIZE);
    flash_write(files_first_addr, 536, WORD_SIZE);
    flash_write(files_sec_addr, 540, WORD_SIZE);
    flash_write(files_third_addr, 544, WORD_SIZE);
    //FILE0
    uint8_t file_string_test0[] = {"file0"}; //16 bytes
    uint8_t timestamp0[WORD_SIZE] = {0, 0, 0, 1}; 
    uint8_t datalength0[WORD_SIZE] = {0, 0, 0, 1}; 
    uint8_t dataaddress0[WORD_SIZE] = {0, 0, 0, 1}; 
    flash_write(file_string_test0, 896, MAX_STRING_SIZE);
    flash_write(timestamp0, 912, WORD_SIZE);
    flash_write(datalength0, 916, WORD_SIZE);
    flash_write(dataaddress0, 920, WORD_SIZE);
    //FILE1
    uint8_t file_string_test1[] = {"file1"}; //16 bytes
    uint8_t timestamp1[WORD_SIZE] = {0, 0, 0, 1}; 
    uint8_t datalength1[WORD_SIZE] = {0, 0, 0, 1}; 
    uint8_t dataaddress1[WORD_SIZE] = {0, 0, 0, 1}; 
    flash_write(file_string_test1, 924, MAX_STRING_SIZE);
    flash_write(timestamp1, 940, WORD_SIZE);
    flash_write(datalength1, 944, WORD_SIZE);
    flash_write(dataaddress1, 948, WORD_SIZE);
    //FILE2
    uint8_t file_string_test2[] = {"file2"}; //16 bytes
    uint8_t timestamp2[WORD_SIZE] = {0, 0, 0, 1}; 
    uint8_t datalength2[WORD_SIZE] = {0, 0, 0, 1}; 
    uint8_t dataaddress2[WORD_SIZE] = {0, 0, 0, 1}; 
    flash_write(file_string_test2, 952, MAX_STRING_SIZE);
    flash_write(timestamp2, 968, WORD_SIZE);
    flash_write(datalength2, 972, WORD_SIZE);
    flash_write(dataaddress2, 976, WORD_SIZE);

    //CHIP 1
    uint8_t chip_string_test1[] = {"chip1"}; //16 bytes
    uint8_t chip_type_ID1[WORD_SIZE] = {0, 0, 7, 0}; 
    uint8_t files_num1[WORD_SIZE] = {0, 0, 7, 0}; 
    uint8_t files_first_addr1[WORD_SIZE] = {0, 0, 255, 255}; 
    flash_write(chip_string_test1, 640, MAX_STRING_SIZE);
    flash_write(chip_type_ID1, 656, WORD_SIZE);
    flash_write(files_num1, 660, WORD_SIZE);
    flash_write(files_first_addr1, 664, WORD_SIZE);
    //CHIP 2
    uint8_t chip_string_test2[] = {"chip2"}; //16 bytes
    uint8_t chip_type_ID2[WORD_SIZE] = {0, 0, 7, 0}; 
    uint8_t files_num2[WORD_SIZE] = {0, 0, 7, 0}; 
    uint8_t files_first_addr2[WORD_SIZE] = {0, 0, 255, 255}; 
    flash_write(chip_string_test2, 768, MAX_STRING_SIZE);
    flash_write(chip_type_ID2, 784, WORD_SIZE);
    flash_write(files_num2, 788, WORD_SIZE);
    flash_write(files_first_addr2, 792, WORD_SIZE);
    
    //NOTE PROJECT 2
    uint8_t project_string_test1[] = {"project1"};
    uint8_t chip_num_test1[WORD_SIZE] = {0, 0, 0, 0};
    flash_write(project_string_test1, 160, MAX_STRING_SIZE); // name string 16 bytes long 
    flash_write(chip_num_test1, 176, WORD_SIZE);
    
    //NOTE PROJECT 3 
    uint8_t project_string_test2[] = {"project2"};
    uint8_t chip_num_test2[WORD_SIZE] = {0, 0, 0, 0};
    flash_write(project_string_test2, 288, MAX_STRING_SIZE); // name string 16 bytes long 
    flash_write(chip_num_test2, 304, WORD_SIZE);
    
