ParkerSD/FlashBlaster/nRF5_SDK_16.0.0_98a08e2/examples/ble_peripheral/ble_app_uart/pca10056/s140/ses/system.c
}


void system_init(void) // create global system struct and read directory info from flash, create project structs 
{   
    system_singleton = system_new();  
    flash_init(); 
    projects_sync(); 
}


char* firmware_version_fetch(void)
{
    //fetch FW version from flash 
    return systemFirmware;
}


char* name_fetch(char* data)
{
    char* name_string = malloc(sizeof(char[MAX_STRING_SIZE])); //TODO FREE 
    memcpy(name_string, data, MAX_STRING_SIZE); //16 bytes = max string length 
    return name_string;
}


//**************************************************************  DISPLAY FUNCTIONS  **************************************************************//

void clear_list(void) //TODO: This argument for future optimizing, write over exact text with black
{
      //SSD1351_draw_filled_rect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color)
      SSD1351_draw_filled_rect(10, 53, 110, 20, COLOR_BLACK);
      SSD1351_draw_filled_rect(10, 80, 110, 20, COLOR_BLACK);
      SSD1351_draw_filled_rect(10, 105, 110, 20, COLOR_BLACK);
}


void rerender_list(int8_t itemHighlighted, uint8_t screenStack) // TODO: limit render to amount of existing items
{   

    if(itemHighlighted == 0)
    {
        clear_list();
        SSD1351_set_cursor(10,57);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item0);
        SSD1351_set_cursor(10,83);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item1);
        SSD1351_set_cursor(10,105);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item2);
        SSD1351_update();
    }
    else if(itemHighlighted == 1)
    {   
        clear_list();
        SSD1351_set_cursor(10,57);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item1);
        SSD1351_set_cursor(10,83);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item2);
        SSD1351_set_cursor(10,105);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item3);
        SSD1351_update();
    }
    else if(itemHighlighted == 2)
    {
        clear_list();
        SSD1351_set_cursor(10,57);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item2);
        SSD1351_set_cursor(10,83);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item3);
        SSD1351_set_cursor(10,105);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item4);
        SSD1351_update();
    }
    else if(itemHighlighted == 3)
    {
        clear_list();
        SSD1351_set_cursor(10,57);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item3);
        SSD1351_set_cursor(10,83);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item4);
        SSD1351_update();
    }
    else if(itemHighlighted == 4)
    {
        clear_list();
        SSD1351_set_cursor(10,57);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item4);
        SSD1351_update();
    }
}


void rerender_screen(int8_t itemHighlighted, int8_t selectedItem, uint8_t screenStack) 
{   
    switch(screenStack)
    {
        case project_screen: 
            L_ currentList = project;
            L_ header = projectHeader; //set initial values for display 
            L_ item0 = SYS_ project_first->project_name; 
            L_ item1 = SYS_ project_first->project_next->project_name;
            L_ item2 = SYS_ project_first->project_next->project_next->project_name;
//            L_ item3 = SYS_ project_first->project_next->project_next->project_next->project_name;
//            L_ item4 = SYS_ project_first->project_next->project_next->project_next->project_next->project_name;
            break;

        case chip_screen: //chip screen
            L_ currentList = chip;
            L_ header = chipHeader;
            if(selectedItem == 0)
            {
                selectedProject = 0; 
                L_ item0 = SYS_ project_first->chip_first->chip_name;
                L_ item1 = SYS_ project_first->chip_first->chip_next->chip_name;
                L_ item2 = SYS_ project_first->chip_first->chip_next->chip_next->chip_name;
                L_ item3 = NULL;
                L_ item4 = NULL;
            }
//            else if(selectedItem == 1)
//            {
//                selectedProject = 1; 
//                L_ item0 = SYS_ project_first->project_next->chip_first->chip_name;
//                L_ item1 = SYS_ project_first->project_next->chip_first->chip_next->chip_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 2)
//            {
//                selectedProject = 2; 
//                L_ item0 = SYS_ project_first->project_next->project_next->chip_first->chip_name;
//                L_ item1 = SYS_ project_first->project_next->project_next->chip_first->chip_next->chip_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 3)
//            {
//                selectedProject = 3; 
//                L_ item0 = SYS_ project_first->project_next->project_next->project_next->chip_first->chip_name;
//                L_ item1 = SYS_ project_first->project_next->project_next->project_next->chip_first->chip_next->chip_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 4)
//            {
//                selectedProject = 4; 
//                L_ item0 = SYS_ project_first->project_next->project_next->project_next->project_next->chip_first->chip_name;
//                L_ item1 = SYS_ project_first->project_next->project_next->project_next->project_next->chip_first->chip_next->chip_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
            break;

        case file_screen: //file screen
            L_ currentList = file;
            L_ header = fileHeader;
            if(selectedItem == 0 && selectedProject == 0) // project 1 chip 1 selected
            {
                L_ item0 = SYS_ project_first->chip_first->file_first->file_name;
                L_ item1 = SYS_ project_first->chip_first->file_first->file_next->file_name;
                L_ item2 = SYS_ project_first->chip_first->file_first->file_next->file_next->file_name;
                L_ item3 = NULL;
                L_ item4 = NULL;
            }
//            else if(selectedItem == 1 && selectedProject == 0) // project 1 chip 2 selected
//            {
//                L_ item0 = SYS_ project_first->chip_first->chip_next->file_first->file_name;
//                L_ item1 = SYS_ project_first->chip_first->chip_next->file_first->file_next->file_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 0 && selectedProject == 1) // project 2 chip 1 selected
//            {
//                L_ item0 = SYS_ project_first->project_next->chip_first->file_first->file_name;
//                L_ item1 = SYS_ project_first->project_next->chip_first->file_first->file_next->file_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 1 && selectedProject == 1) // project 2 chip 2 selected
//            {
//                L_ item0 = SYS_ project_first->project_next->chip_first->chip_next->file_first->file_name;
//                L_ item1 = SYS_ project_first->project_next->chip_first->chip_next->file_first->file_next->file_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 0 && selectedProject == 2) // project 3 chip 1 selected
//            {
//                L_ item0 = SYS_ project_first->project_next->project_next->chip_first->file_first->file_name;
//                L_ item1 = SYS_ project_first->project_next->project_next->chip_first->file_first->file_next->file_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 1 && selectedProject == 2) // project 3 chip 2 selected
//            {
//                L_ item0 = SYS_ project_first->project_next->project_next->chip_first->chip_next->file_first->file_name; //runs out of filenames here
//                L_ item1 = SYS_ project_first->project_next->project_next->chip_first->chip_next->file_first->file_next->file_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 0 && selectedProject == 3) // project 4 chip 1 selected
//            {
//                L_ item0 = SYS_ project_first->project_next->project_next->project_next->chip_first->file_first->file_name;
//                L_ item1 = SYS_ project_first->project_next->project_next->project_next->chip_first->file_first->file_next->file_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 1 && selectedProject == 3) // project 4 chip 2 selected
//            {
//                L_ item0 = SYS_ project_first->project_next->project_next->project_next->chip_first->chip_next->file_first->file_name;
//                L_ item1 = SYS_ project_first->project_next->project_next->project_next->chip_first->chip_next->file_first->file_next->file_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 0 && selectedProject == 4) // project 5 chip 1 selected
//            {
//                L_ item0 = SYS_ project_first->project_next->project_next->project_next->project_next->chip_first->file_first->file_name;
//                L_ item1 = SYS_ project_first->project_next->project_next->project_next->project_next->chip_first->file_first->file_next->file_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 1 && selectedProject == 4) // project 5 chip 2 selected
//            {
//                L_ item0 = SYS_ project_first->project_next->project_next->project_next->project_next->chip_first->chip_next->file_first->file_name;
//                L_ item1 = SYS_ project_first->project_next->project_next->project_next->project_next->chip_first->chip_next->file_first->file_next->file_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
            break; 

        case exe_screen:
            break; 

        default:
            break; 
    }

    rerender_list(itemHighlighted,screenStack);

    if(L_ boxPresent == false)
    {
        draw_selection_box();
    }

    if(L_ headerPresent == false)
    {
        draw_header();
    }
}